<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"1a5f657a15e847e706b79a36cee2a1077a46761cc2b970459bc8941af6719488","plan_job_ref":"Job Create Terraform plan (DEV) #42 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14970105717","plan_out_hash":"0daf18a40916d4e14956d17c4df13a6dd77557510be3320e8c3a68d09f6b5c76","plan_hash":"5af83b3ec3ef4df962dae878f0b4edfb7869fb1e577ac0778ab77032be51dd75","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_dns_zone.openmrs-fchevalier will be created
+   resource "azurerm_dns_zone" "openmrs-fchevalier" {
+       id                        = (known after apply)
+       max_number_of_record_sets = (known after apply)
+       name                      = "audioprothese.fchevalier.net"
+       name_servers              = (known after apply)
+       number_of_record_sets     = (known after apply)
+       resource_group_name       = "openmrs"

+       soa_record (known after apply)
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/openmrs/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.grafana will be updated in-place
!~  resource "helm_release" "grafana" {
        id                         = "grafana"
!~      metadata                   = [
-           {
-               app_version    = "12.0.0"
-               chart          = "grafana"
-               first_deployed = 1747043462
-               last_deployed  = 1747043462
-               name           = "grafana"
-               namespace      = "monitoring"
-               notes          = <<-EOT
                    1. Get your 'admin' user password by running:
                    
                       kubectl get secret --namespace monitoring grafana -o jsonpath="{.data.admin-password}" | base64 --decode ; echo
                    
                    
                    2. The Grafana server can be accessed via port 80 on the following DNS name from within your cluster:
                    
                       grafana.monitoring.svc.cluster.local
                    
                       If you bind grafana to 80, please update values in values.yaml and reinstall:
                       ```
                       securityContext:
                         runAsUser: 0
                         runAsGroup: 0
                         fsGroup: 0
                    
                       command:
                       - "setcap"
                       - "'cap_net_bind_service=+ep'"
                       - "/usr/sbin/grafana-server &&"
                       - "sh"
                       - "/run.sh"
                       ```
                       Details refer to https://grafana.com/docs/installation/configuration/#http-port.
                       Or grafana would always crash.
                    
                       From outside the cluster, the server URL(s) are:
                         http://grafana.audioprothese.duckdns.org
                    
                    3. Login with the password from step 1 and the username: admin
                    #################################################################################
                    ######   WARNING: Persistence is disabled!!! You will lose your data when   #####
                    ######            the Grafana pod is terminated.                            #####
                    #################################################################################
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       ingress = {
-                           annotations      = {}
-                           enabled          = true
-                           extraPaths       = []
-                           hosts            = [
-                               "grafana.audioprothese.duckdns.org",
                            ]
-                           ingressClassName = "webapprouting.kubernetes.azure.com"
-                           labels           = {}
-                           path             = "/"
-                           pathType         = "Prefix"
-                           tls              = []
                        }
                    }
                )
-               version        = "9.0.0"
            },
        ] -> (known after apply)
        name                       = "grafana"
!~      values                     = [
!~          <<-EOT
                ingress:
                  enabled: true
                  annotations: {}
                  labels: {}
                  path: /
                  pathType: Prefix
                  hosts:
              -     - grafana.audioprothese.duckdns.org
              +     - grafana.audioprothese.fchevalier.net
                  extraPaths: []
                  tls: []
                  ingressClassName: "webapprouting.kubernetes.azure.com"
            EOT,
        ]
#        (26 unchanged attributes hidden)
    }

  # helm_release.prometheus will be updated in-place
!~  resource "helm_release" "prometheus" {
        id                         = "prometheus"
!~      metadata                   = [
-           {
-               app_version    = "v3.3.1"
-               chart          = "prometheus"
-               first_deployed = 1747043462
-               last_deployed  = 1747043462
-               name           = "prometheus"
-               namespace      = "monitoring"
-               notes          = <<-EOT
                    1. Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=alertmanager,app.kubernetes.io/instance=prometheus" -o jsonpath="{.items[0].metadata.name}")
                      echo "Visit http://127.0.0.1:9093 to use your application"
                      kubectl --namespace monitoring port-forward $POD_NAME 9093:80
                    
                    kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                    The exposed metrics can be found here:
                    https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                    
                    The metrics are exported on the HTTP endpoint /metrics on the listening port.
                    In your case, prometheus-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                    
                    They are served either as plaintext or protobuf depending on the Accept header.
                    They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                    
                    1. Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-pushgateway,app.kubernetes.io/instance=prometheus" -o jsonpath="{.items[0].metadata.name}")
                      kubectl port-forward $POD_NAME 9091
                      echo "Visit http://127.0.0.1:9091 to use your application"
                    
                    The Prometheus server can be accessed via port 80 on the following DNS name from within your cluster:
                    prometheus-server.monitoring.svc.cluster.local
                    
                    From outside the cluster, the server URL(s) are:
                    http://prometheus.audioprothese.duckdns.org
                    
                    
                    The Prometheus alertmanager can be accessed via port 9093 on the following DNS name from within your cluster:
                    prometheus-alertmanager.monitoring.svc.cluster.local
                    
                    
                    Get the Alertmanager URL by running these commands in the same shell:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=alertmanager,app.kubernetes.io/instance=prometheus" -o jsonpath="{.items[0].metadata.name}")
                      kubectl --namespace monitoring port-forward $POD_NAME 9093
                    #################################################################################
                    ######   WARNING: Pod Security Policy has been disabled by default since    #####
                    ######            it deprecated after k8s 1.25+. use                        #####
                    ######            (index .Values "prometheus-node-exporter" "rbac"          #####
                    ###### .          "pspEnabled") with (index .Values                         #####
                    ######            "prometheus-node-exporter" "rbac" "pspAnnotations")       #####
                    ######            in case you still need it.                                #####
                    #################################################################################
                    
                    
                    The Prometheus PushGateway can be accessed via port 9091 on the following DNS name from within your cluster:
                    prometheus-prometheus-pushgateway.monitoring.svc.cluster.local
                    
                    
                    Get the PushGateway URL by running these commands in the same shell:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app=prometheus-pushgateway,component=pushgateway" -o jsonpath="{.items[0].metadata.name}")
                      kubectl --namespace monitoring port-forward $POD_NAME 9091
                    
                    For more information on running Prometheus, visit:
                    https://prometheus.io/
                    
                    1. Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=prometheus" -o jsonpath="{.items[0].metadata.name}")
                      echo "Visit http://127.0.0.1:9100 to use your application"
                      kubectl port-forward --namespace monitoring $POD_NAME 9100
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       server = {
-                           extraPaths = []
-                           ingress    = {
-                               annotations      = {}
-                               enabled          = true
-                               hosts            = [
-                                   "prometheus.audioprothese.duckdns.org",
                                ]
-                               ingressClassName = "webapprouting.kubernetes.azure.com"
-                               labels           = {}
-                               path             = "/"
-                               pathType         = "Prefix"
                            }
-                           tls        = []
                        }
                    }
                )
-               version        = "27.13.0"
            },
        ] -> (known after apply)
        name                       = "prometheus"
!~      values                     = [
!~          <<-EOT
                server:
                  ingress:
                    enabled: true
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                    annotations: {}
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
              -       - prometheus.audioprothese.duckdns.org
              +       - prometheus.audioprothese.fchevalier.net
                  extraPaths: []
                  tls: []
            EOT,
        ]
#        (26 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Changes to Outputs:
+   azure-nameservers = (known after apply)
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #42](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14970105717)